Revit 2027 API
StructuralSectionsFailures Properties
The BuiltInFailures.StructuralSectionsFailures type exposes the following members.
Properties
Name | Description
StructuralSectionCannotBeDetermined |  The section cannot be determined.
StructuralSectionShapesDoNotMatch |  Family Shape does not match the geometry of the element.
Top
See Also
Reference
BuiltInFailures.StructuralSectionsFailures Class
Autodesk.Revit.DB Namespace